In [1]:
import pandas as pd
pd.__version__

'2.2.2'

In [5]:
import pandas as pd

def create_medications(names, counts):
    medications = pd.Series(data = counts, index = names)
    return medications


def get_percent(medications, name):
    return medications.loc[name]/sum(medications)*100
    
names=['chlorhexidine', 'cyntomycin', 'afobazol']
counts=[15, 18, 7]
medications = create_medications(names, counts)

print(get_percent(medications, "chlorhexidine")) #37.5

37.5

In [40]:
import pandas as pd

income = [478, 512, 196]
expenses = [156, 130, 270]
years = [2018, 2019, 2020]

def create_companyDF(income, expenses, years):
    
    companyDF = pd.DataFrame({'Income': income, 'Expenses': expenses,})
    companyDF.index = years
    return companyDF
    
print(create_companyDF(income, expenses, years))

def get_profit(df, year):
    if year in df.index:
        profit = df.loc[year, 'Income'] - df.loc[year, 'Expenses']
        return profit
    return None

print(get_profit(df, 2020))

      Income  Expenses
2018     478       156
2019     512       130
2020     196       270
-74

In [42]:
income = [612, 516, 329, 158]
expenses = [136, 163, 250, 361]
years = [2017, 2018, 2019, 2020]
print(create_companyDF(income, expenses, years))

      Income  Expenses
2017     612       136
2018     516       163
2019     329       250
2020     158       361

In [44]:
data = pd.DataFrame([[0,1], [1, 0], [1, 1]], columns=['–ê', 'B'])
print(data.shape)

(3, 2)

In [45]:
student_data = pd.read_csv('data/students_performance.csv')

In [47]:
student_data.shape

(1000, 8)

In [50]:
display(student_data.head(6))
display(student_data.tail())

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [52]:
student_data.shape

(1000, 8)

In [55]:
student_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [60]:
student_data.loc[155]

gender                               female
race/ethnicity                      group C
parental level of education    some college
lunch                              standard
test preparation course           completed
math score                               70
reading score                            89
writing score                            88
Name: 155, dtype: object

In [62]:
student_data.isnull().sum().sum()

np.int64(0)

In [63]:
student_data.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [72]:
student_data['race/ethnicity'].mode()

0    group C
Name: race/ethnicity, dtype: object

In [70]:
student_data[student_data['test preparation course'] == 'completed']['reading score'].mean()

np.float64(73.89385474860335)

In [71]:
student_data[student_data['math score'] == 0].shape[0]

1

In [73]:
student_data[student_data['lunch'] == 'standard']['math score'].mean() > student_data[student_data['lunch'] == 'free/reduced']['math score'].mean()

np.True_

In [74]:
student_data[student_data['lunch'] == 'standard']['math score'].mean()

np.float64(70.03410852713178)

In [75]:
student_data[student_data['lunch'] == 'free/reduced']['math score'].mean()

np.float64(58.92112676056338)

In [80]:
student_data['parental level of education'].value_counts(normalize=True)

parental level of education
some college          0.226
associate's degree    0.222
high school           0.196
some high school      0.179
bachelor's degree     0.118
master's degree       0.059
Name: proportion, dtype: float64

In [86]:
a = (student_data[student_data['race/ethnicity'] == 'group A']['writing score'].median())
b = (student_data[student_data['race/ethnicity'] == 'group C']['writing score'].mean())
display(a-b)

np.float64(-5.827586206896555)